/*!------------------------------------------------
@file       Facilities.h
@brief      
@attention  なし
--------------------------------------------------*/

#ifndef FACILITIES_H_
#define FACILITIES_H_

// インクルードファイル ================================

// クラスの前方宣言 ====================================

// マクロの宣言 ========================================

// 型の宣言 ============================================

// クラス定義 ==========================================
/*!--------------------------------------------------
@class       Facilities.h
@brief      
@note       
@attention  なし
@see        なし
--------------------------------------------------*/
class Facilities {
 public:
  //! Constructor
  Facilities();
  //! Destructor
  virtual ~Facilities();

 protected:
 private:
};

#endif  // FACILITIES_H_
