/*!------------------------------------------------
@file       Levels.h
@brief      
@attention  なし
--------------------------------------------------*/

#ifndef LEVELS_H_
#define LEVELS_H_

// インクルードファイル ================================

// クラスの前方宣言 ====================================

// マクロの宣言 ========================================

// 型の宣言 ============================================

// クラス定義 ==========================================
/*!--------------------------------------------------
@class       Levels.h
@brief      
@note       
@attention  なし
@see        なし
--------------------------------------------------*/
class Levels {
 public:
  //! Constructor
  Levels();
  //! Destructor
  virtual ~Levels();

 protected:
 private:
};

#endif  // LEVELS_H_
