/*!------------------------------------------------
@file       LoggerFactory.h
@brief      
@attention  なし
--------------------------------------------------*/

#include "LoggerFactory.h"

/*!------------------------------------------------
@brief      デフォルトコンストラクタ
@note       クラスを構築する
@attention  なし
--------------------------------------------------*/
LoggerFactory::LoggerFactory() {
}

/*!------------------------------------------------
@brief      デフォルトデストラクタ
@note       クラスを破棄する
@attention  なし
--------------------------------------------------*/
LoggerFactory::~LoggerFactory() {
}

/*!------------------------------------------------
@brief      
@note       
@param[in]  パラメータ名  説明  [単位] (範囲)
@param[out] 
@return     なし
@attention  なし
--------------------------------------------------*/
