/*!------------------------------------------------
@file       SyslogLoggerFactory.h
@brief      
@attention  なし
--------------------------------------------------*/

#include "SyslogLoggerFactory.h"

/*!------------------------------------------------
@brief      デフォルトコンストラクタ
@note       クラスを構築する
@attention  なし
--------------------------------------------------*/
SyslogLoggerFactory::SyslogLoggerFactory() {
}

/*!------------------------------------------------
@brief      デフォルトデストラクタ
@note       クラスを破棄する
@attention  なし
--------------------------------------------------*/
SyslogLoggerFactory::~SyslogLoggerFactory() {
}

/*!------------------------------------------------
@brief      
@note       
@param[in]  パラメータ名  説明  [単位] (範囲)
@param[out] 
@return     なし
@attention  なし
--------------------------------------------------*/
